bekencorp/bk_idk/middleware/soc/bk7286/soc/pwm_struct.h
// Copyright 2020-2021 Beken 
// 
// Licensed under the Apache License, Version 2.0 (the "License");           
// you may not use this file except in compliance with the License.            
// You may obtain a copy of the License at                                     
//                                                                             
//     http://www.apache.org/licenses/LICENSE-2.0                              
//                                                                             
// Unless required by applicable law or agreed to in writing, software         
// distributed under the License is distributed on an "AS IS" BASIS,         
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.    
// See the License for the specific language governing permissions and         
// limitations under the License.                                              

/***********************************************************************************************************************************
* This file is generated from PWM_register_map.xlsx automatically                                
* Modify it manually is not recommended                                       
* CHIP ID:BK7286,GENARATE TIME:2023-03-23 15:46:12                                                 
************************************************************************************************************************************/

#pragma once                 
                            
#ifdef __cplusplus          
extern "C" {              
#endif                      

typedef volatile struct {

    /* REG_0x00 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  deviceid                       :32;  //0x0[31:0],ASCII Code of "PWM",0x00808777,RO
        }; 
        uint32_t v; 
    }deviceid; 

    /* REG_0x01 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  versionid                      :32;  //0x1[31:0],版本号V1.1:w(区别不同版本),0x00010001,RO
        }; 
        uint32_t v; 
    }versionid; 

    /* REG_0x02 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  soft_reset                     : 1;  //0x2[0],写1：PWM控制器软复位,0x0,R/W
           volatile uint32_t  bps_clkgate                    : 1;  //0x2[1],配置时钟门控禁止位,0x0,R/W
           volatile uint32_t  reserved                     :30;  //0x2[31:2],写1：PWM控制器软复位,0x0,R/W
        }; 
        uint32_t v; 
    }cg_reset; 

    /* REG_0x03 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  global_status                  :32;  //0x3[31:0],反应外设的工作状态,0x0,RO
        }; 
        uint32_t v; 
    }status; 

    /* REG_0x04 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  cen3                           : 1;  //0x4[0],计数器TIM3使能,0x0,R/W
           volatile uint32_t  cen2                           : 1;  //0x4[1],计数器TIM2使能,0x0,R/W
           volatile uint32_t  cen1                           : 1;  //0x4[2],计数器TIM1使能,0x0,R/W
           volatile uint32_t  arpe3                          : 1;  //0x4[3],计数器TIM3终点寄存器preload使能,0x0,R/W
           volatile uint32_t  arpe2                          : 1;  //0x4[4],计数器TIM2终点寄存器preload使能,0x0,R/W
           volatile uint32_t  arpe1                          : 1;  //0x4[5],计数器TIM1终点寄存器preload使能  0为preload寄存器中中的值立即同步更新到阴影寄存器，1为在更新事件时更新（Auto-Reload Preload Enable),0x0,R/W
           volatile uint32_t  oc3pe                          : 1;  //0x4[6],TIM3的比较寄存器preload使能见OC1PE,0x0,R/W
           volatile uint32_t  oc2pe                          : 1;  //0x4[7],TIM2的比较寄存器preload使能见OC1PE,0x0,R/W
           volatile uint32_t  oc1pe                          : 1;  //0x4[8],TIM1的比较寄存器CCR1~CCR3 preload使能  0为preload寄存器中中的值立即同步更新到阴影寄存器，1为在更新事件时更新,0x0,R/W
           volatile uint32_t  reserved0                       : 9;  //0x4[17:9], ,None,None
           volatile uint32_t  cms_tim3                       : 2;  //0x4[19:18],计数器TIM1计数模式：; 00单向计数模式; 01双向计数模式 且只有向上计数比较成功时才置位比较成功中断flag; 10双向计数模式 且只有向下计数比较成功时才置位比较成功中断flag; 11双向计数模式 且向上和向下计数比较成功时都置位比较成功中断flag,2,R/W
           volatile uint32_t  cms_tim2                       : 2;  //0x4[21:20],计数器TIM2计数模式：同CMS_TIM1,0x0,R/W
           volatile uint32_t  cms_tim1                       : 2;  //0x4[23:22],计数器TIM3计数模式：同CMS_TIM1,0x0,R/W
           volatile uint32_t  reserved1                       : 2;  //0x4[25:24], ,None,None
           volatile uint32_t  urs3                           : 1;  //0x4[26],见URS1,0x0,R/W
           volatile uint32_t  urs2                           : 1;  //0x4[27],见URS1,0x0,R/W
           volatile uint32_t  urs1                           : 1;  //0x4[28],更新事件源选择  0：UG与向上向下溢出可产生更新事件;                 1：仅向上向下溢出可产生更新事件（捕获模式必须设置为1，否则会同时产生捕获成功中断和更新事件中断）,0x0,R/W
           volatile uint32_t  dir_tim3                       : 1;  //0x4[29],计数器TIM3的方向：同DIR_TIM1,0x0,R/W
           volatile uint32_t  dir_tim2                       : 1;  //0x4[30],计数器TIM2的方向：同DIR_TIM1,0x0,R/W
           volatile uint32_t  dir_tim1                       : 1;  //0x4[31],计数器TIM1的方向  0为向上计数  1为向下计数 （当工作在编码器模式或者中心对称模式时，该位为只读）,0x0,R/W
        }; 
        uint32_t v; 
    }pwm_cr1; 

    /* REG_0x05 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  reserved0                       : 8;  //0x5[7:0], ,0x0,R/W
           volatile uint32_t  ti1s                           : 1;  //0x5[8],TIM1的触发输入源选择; 0 cap_i[0]作为TI1的输入; 1 cap_i[2:0]的XOR作为TI1的输入，霍尔传感器接口模式用,0x0,R/W
           volatile uint32_t  ccpc                           : 1;  //0x5[9],CCE，CCNE bit preload   ; 该bi为1时：CCE，CCEN只有在COM事件（霍尔模式时TRGI上升沿）发生时才更新 ,0x0,R/W
           volatile uint32_t  trios3                         : 3;  //0x5[12:10],TIM3的触发输出选择 同TRIOS1,0x0,R/W
           volatile uint32_t  adcs3                          : 3;  //0x5[15:13],TIM3的ADC触发选择  同ADCS1,0x0,R/W
           volatile uint32_t  reserved1                       : 1;  //0x5[16], ,0x0,R/W
           volatile uint32_t  ccus                           : 1;  //0x5[17], ,0x0,R/W
           volatile uint32_t  trios2                         : 3;  //0x5[20:18],TIM2的触发输出选择 同TRIOS1,0x0,R/W
           volatile uint32_t  adcs2                          : 3;  //0x5[23:21],TIM2的ADC触发选择  同ADCS1 ,0x0,R/W
           volatile uint32_t  reserved2                       : 2;  //0x5[25:24], ,0x0,R/W
           volatile uint32_t  trios1                         : 3;  //0x5[28:26],TIM1的触发输出选择 ; 0 触发输出0; 1 CEN作为TRIO触发输出; 2 UG作为TRIO触发输出; 3 update事件触发输出; 4 OC1REF作为TRIO触发输出; 5 CCR1比较成功信号cc1g作为TRIO触发输出; 6 CCR2比较成功信号cc2g作为TRIO触发输出; 7 CCR3比较成功信号cc3g作为TRIO触发输出; 8 OC1REF作为TRIO触发输出; 9 CCIF信号即（比较或者捕获成功）作为TRIO触发输出,0x0,R/W
           volatile uint32_t  adcs1                          : 3;  //0x5[31:29],TIM1的触发ADC选择 ; 0 触发ADC0; 1 CEN作为TRIO触发ADC; 2 UG作为TRIO触发ADC; 3 update事件触发ADC; 4 OC1REF作为TRIO触发ADC; 5 CCR1比较成功信号cc1g作为TRIO触发ADC; 6 CCR2比较成功信号cc2g作为TRIO触发ADC; 7 CCR3比较成功信号cc3g作为TRIO触发ADC; 8 OC1REF作为TRIO触发ADC; 9 CCIF信号即（比较或者捕获成功）作为TRIO触发ADC,0x0,R/W
        }; 
        uint32_t v; 
    }pwm_cr2; 

    /* REG_0x06 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  sms1                           : 4;  //0x6[3:0],TIM1从模式选择：; 0000 从模式关闭  定时器对内部时钟沿计数; 0001 LED驱动模式; 0010 编码器接口模式1  只对TI1的边沿向上下计数; 0011 编码器接口模式2  只对TI2的边沿向上下计数; 0100 编码器接口模式3  对TI1和TI2的边沿都向上下计数; 101 重置模式1   TRGI2的上升沿UG1置1，定时器重置（捕获模式时可使用）; 110 门控模式   TRGI2为高电平CEN1置1，为低CEN1清零（模块外部定时器控制TIM1启停）; 111 触发模式   TRGI2的上升沿CEN1置1（对外部脉冲计数）; 1000 霍尔传感器接口模式,0x0,R/W
           volatile uint32_t  sms2                           : 4;  //0x6[7:4],TIM2从模式选择：; 000 从模式关闭  定时器对内部时钟沿计数; 001 LED驱动模式; 010 编码器接口模式1  只对TI3的边沿向上下计数; 011 编码器接口模式2  只对TI4的边沿向上下计数; 100 编码器接口模式3  对TI3和TI4的边沿都向上下计数; 101 重置模式1   TRGI2的上升沿UG2置1，定时器重置（捕获模式时可使用）; 110 门控模式   TRGI2为高电平CEN2置1，为低CEN2清零（模块外部定时器控制TIM3启停）; 111 触发模式   TRGI2的上升沿CEN2置1（对外部脉冲计数）,0x0,R/W
           volatile uint32_t  sms3                           : 4;  //0x6[11:8],TIM3从模式选择：; 000 从模式关闭  定时器对内部时钟沿计数; 001 LED驱动模式; 010 编码器接口模式1  只对TI5的边沿向上下计数; 011 编码器接口模式2  只对TI6的边沿向上下计数; 100 编码器接口模式3  对TI5和TI6的边沿都向上下计数; 101 重置模式1   TRGI3的上升沿UG3置1，定时器重置（捕获模式时可使用）; 110 门控模式   TRGI3为高电平CEN3置1，为低CEN3清零（模块外部定时器控制TIM3启停）; 111 触发模式   TRGI3的上升沿CEN3置1（对外部脉冲计数）,0x0,R/W
           volatile uint32_t  ts1                            : 3;  //0x6[14:12],TIM1触发输入源选择：; 000 TI1P TI1的单边沿检测脉冲; 001 TI2P TI2的单边沿检测脉冲; 010 TI1_ED  TI1的双边沿检测脉冲; 010 TI2_ED  TI2的双边沿检测脉冲; 101 tri_i[2] ; 101 tri_i[1] ; 110 tri_i[0] ,0x0,R/W
           volatile uint32_t  reserved0                       : 1;  //0x6[15], ,0x0,R/W
           volatile uint32_t  ts2                            : 3;  //0x6[18:16],TIM2触发输入源选择：; 000 TI3P TI3的单边沿检测脉冲; 001 TI4P TI4的单边沿检测脉冲; 010 TI3_ED  TI3的双边沿检测脉冲; 011 TI4_ED  TI4的双边沿检测脉冲; 100 tri_i[2] ; 101 tri_i[1] ; 110 tri_i[0] ,0x0,R/W
           volatile uint32_t  ts3                            : 3;  //0x6[21:19],TIM3触发输入源选择：; 000 TI5P TI5的单边沿检测脉冲; 001 TI6P TI6的单边沿检测脉冲; 010 TI5_ED  TI3的双边沿检测脉冲; 011 TI6_ED  TI4的双边沿检测脉冲; 100 tri_i[2] ; 101 tri_i[1] ; 110 tri_i[0] ,0x0,R/W
           volatile uint32_t  reserved1                       :10;  //0x6[31:22], ,0x0,R/W
        }; 
        uint32_t v; 
    }smcr; 

    /* REG_0x07 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  cc1ie                          : 1;  //0x7[0],CCR1比较成功中断使能  0 disable  1 enable,0x0,R/W
           volatile uint32_t  cc2ie                          : 1;  //0x7[1],CCR2比较成功中断使能  0 disable  1 enable,0x0,R/W
           volatile uint32_t  cc3ie                          : 1;  //0x7[2],CCR3比较成功中断使能  0 disable  1 enable,0x0,R/W
           volatile uint32_t  cc4ie                          : 1;  //0x7[3],CCR4比较成功中断使能  0 disable  1 enable,0x0,R/W
           volatile uint32_t  cc5ie                          : 1;  //0x7[4],CCR5比较成功中断使能  0 disable  1 enable,0x0,R/W
           volatile uint32_t  cc6ie                          : 1;  //0x7[5],CCR6比较成功中断使能  0 disable  1 enable,0x0,R/W
           volatile uint32_t  cc7ie                          : 1;  //0x7[6],CCR7比较成功中断使能  0 disable  1 enable,0x0,R/W
           volatile uint32_t  cc8ie                          : 1;  //0x7[7],CCR8比较成功中断使能  0 disable  1 enable,0x0,R/W
           volatile uint32_t  cc9ie                          : 1;  //0x7[8],CCR9比较成功中断使能  0 disable  1 enable,0x0,R/W
           volatile uint32_t  uie1                           : 1;  //0x7[9],TIM1更新事件中断使能  0 disable  1 enable,0x0,R/W
           volatile uint32_t  uie2                           : 1;  //0x7[10],TIM2更新事件中断使能  0 disable  1 enable,0x0,R/W
           volatile uint32_t  uie3                           : 1;  //0x7[11],TIM3更新事件中断使能  0 disable  1 enable,0x0,R/W
           volatile uint32_t  tie1                           : 1;  //0x7[12],触发输入中断使能  0 disable  1 enable,0x0,R/W
           volatile uint32_t  tie2                           : 1;  //0x7[13],触发输入DMA请求使能  0 disable  1 enable,0x0,R/W
           volatile uint32_t  tie3                           : 1;  //0x7[14],CCR1比较成功DMA请求使能  0 disable  1 enable,0x0,R/W
           volatile uint32_t  comie                          : 1;  //0x7[15],COM事件中断使能  0 disable  1 enble （霍尔传感器模式用）,0x0,R/W
           volatile uint32_t  reserved                       : 4;  //0x7[19:16], ,0x0,R/W
           volatile uint32_t  df_tim1                        : 4;  //0x7[23:20],数字滤波选择,0x0,R/W
           volatile uint32_t  df_tim2                        : 4;  //0x7[27:24], ,0x0,R/W
           volatile uint32_t  df_tim3                        : 4;  //0x7[31:28], ,0x0,R/W
        }; 
        uint32_t v; 
    }pwm_dier; 

