bekencorp/bk_idk/middleware/soc/bk7286/soc/pwm_struct.h
    /* REG_0x08 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  cc1if                          : 1;  //0x8[0],CCR1比较成功中断标志位  ; 硬件置位：输出模式时比较成功时置位。对于双向计数模式有三种选项在CMS_TIM1中设定。 ; 输入模式时当TIM1的值被CCR1捕获时置位。; 软件清零,0x0,W1C
           volatile uint32_t  cc2if                          : 1;  //0x8[1],见CC1IF,0x0,W1C
           volatile uint32_t  cc3if                          : 1;  //0x8[2],见CC1IF,0x0,W1C
           volatile uint32_t  cc4if                          : 1;  //0x8[3],见CC1IF,0x0,W1C
           volatile uint32_t  cc5if                          : 1;  //0x8[4],见CC1IF,0x0,W1C
           volatile uint32_t  cc6if                          : 1;  //0x8[5],见CC1IF,0x0,W1C
           volatile uint32_t  cc7if                          : 1;  //0x8[6],见CC1IF,0x0,W1C
           volatile uint32_t  cc8if                          : 1;  //0x8[7],见CC1IF,0x0,W1C
           volatile uint32_t  cc9if                          : 1;  //0x8[8],见CC1IF,0x0,W1C
           volatile uint32_t  uif1                           : 1;  //0x8[9],TIM1更新事件中断标志位; 硬件置位：1.当计数器向上溢出或者向下溢出时置位;          2.当UG1位被软件置1或者被触发信号置1时置位  ; 软件清零,0x0,W1C
           volatile uint32_t  uif2                           : 1;  //0x8[10],见UIF1,0x0,W1C
           volatile uint32_t  uif3                           : 1;  //0x8[11],见UIF1,0x0,W1C
           volatile uint32_t  tif1                           : 1;  //0x8[12],触发中断标志位 ; 硬件置位：当工作在触发输入模式时，TRGI1的上升沿置位。; 软件清零,0x0,W1C
           volatile uint32_t  tif2                           : 1;  //0x8[13],触发中断标志位 ; 硬件置位：当工作在触发输入模式时，TRGI2的上升沿置位。; 软件清零,0x0,W1C
           volatile uint32_t  tif3                           : 1;  //0x8[14],触发中断标志位 ; 硬件置位：当工作在触发输入模式时，TRGI3的上升沿置位。; 软件清零,0x0,W1C
           volatile uint32_t  comif                          : 1;  //0x8[15],COM事件中断标志位（霍尔传感器模式用）; 硬件置位：; 软件清零,0x0,W1C
           volatile uint32_t  reserved                       :16;  //0x8[31:16], ,0x0,R/W
        }; 
        uint32_t v; 
    }pwm_sr; 

    /* REG_0x09 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  reserved0                       : 9;  //0x9[8:0], ,0x0,R/W
           volatile uint32_t  ug1                            : 1;  //0x9[9],软件产生更新事件 TIM1,0x0,W
           volatile uint32_t  ug2                            : 1;  //0x9[10],软件产生更新事件 TIM2,0x0,W
           volatile uint32_t  ug3                            : 1;  //0x9[11],软件产生更新事件 TIM3,0x0,W
           volatile uint32_t  tg1                            : 1;  //0x9[12],触发事件产生  软件/硬件置位  硬件自动清零,0x0,W
           volatile uint32_t  tg2                            : 1;  //0x9[13],触发事件产生  软件/硬件置位  硬件自动清零,0x0,W
           volatile uint32_t  tg3                            : 1;  //0x9[14],触发事件产生  软件/硬件置位  硬件自动清零,0x0,W
           volatile uint32_t  comg                           : 1;  //0x9[15],COM事件产生   硬件置位  硬件自动清零,0x0,W
           volatile uint32_t  dtm1                           : 2;  //0x9[17:16],CH1和CH2的死区时间模式：; 00 OCP在ocref上升沿延迟，OCN在ocref下降沿延迟; 01 OCN在ocref上升沿延迟，OCP在ocref下降沿延迟; 10 OCP在ocref上升沿延迟，OCP在ocref下降沿延迟; 11 OCN在ocref上升沿延迟，OCN在ocref下降沿延迟,0x0,R/W
           volatile uint32_t  dtm2                           : 2;  //0x9[19:18],CH3和CH4的死区时间模式：,0x0,R/W
           volatile uint32_t  dtm3                           : 2;  //0x9[21:20],CH5和CH6的死区时间模式：,0x0,R/W
           volatile uint32_t  reserved1                       :10;  //0x9[31:22], ,0x0,R/W
        }; 
        uint32_t v; 
    }pwm_edtr; 

    /* REG_0x0a */
    union 
    { 
        struct 
        { 
           volatile uint32_t  ch1p                           : 2;  //0xa[1:0],TI1的输入极性: ; 00 上升沿敏感(捕获/触发) TI1P不反向(encoder mode); 01 下降沿敏感（捕获/触发）  同时TI1P反向（encoder mode）; 10 上升下降沿都敏感（捕获/触发）,0x0,R/W
           volatile uint32_t  ch2p                           : 2;  //0xa[3:2],见CH1P,0x0,R/W
           volatile uint32_t  ch3p                           : 2;  //0xa[5:4],见CH1P,0x0,R/W
           volatile uint32_t  ch4p                           : 2;  //0xa[7:6],见CH1P,0x0,R/W
           volatile uint32_t  ch5p                           : 2;  //0xa[9:8],见CH1P,0x0,R/W
           volatile uint32_t  ch6p                           : 2;  //0xa[11:10],见CH1P,0x0,R/W
           volatile uint32_t  ch1e                           : 1;  //0xa[12],CH1E通道输入/输出使能,0x0,R/W
           volatile uint32_t  ch2e                           : 1;  //0xa[13],见CH1E,0x0,R/W
           volatile uint32_t  ch3e                           : 1;  //0xa[14],见CH1E,0x0,R/W
           volatile uint32_t  ch4e                           : 1;  //0xa[15],见CH1E,0x0,R/W
           volatile uint32_t  ch5e                           : 1;  //0xa[16],见CH1E,0x0,R/W
           volatile uint32_t  ch6e                           : 1;  //0xa[17],见CH1E,0x0,R/W
           volatile uint32_t  tim1ccm                        : 1;  //0xa[18],TIM1的比较捕获模式: 0输出比较模式 1输入捕获模式,0x0,R/W
           volatile uint32_t  tim2ccm                        : 1;  //0xa[19],见TIM1CCM,0x0,R/W
           volatile uint32_t  tim3ccm                        : 1;  //0xa[20],见TIM1CCM,0x0,R/W
           volatile uint32_t  oc1m                           : 3;  //0xa[23:21],TIM1的比较输出模式选择：; 000：OC1REF不受计数值的影响保持不变; 001：OC1REF碰到AAR不翻转，碰到CCRx翻转; 010：OC1REF set 1; 011：OC1REF碰到CCRx时翻转，碰到AAR也翻转->ARR; 100：OC1REF set 0,0x0,R/W
           volatile uint32_t  oc2m                           : 3;  //0xa[26:24],见OC1M,0x0,R/W
           volatile uint32_t  oc3m                           : 3;  //0xa[29:27],见OC1M,0x0,R/W
           volatile uint32_t  reserved                       : 2;  //0xa[31:30], ,0x0,R/W
        }; 
        uint32_t v; 
    }pwm_ccmr; 

    /* REG_0x0b */
    union 
    { 
        struct 
        { 
           volatile uint32_t  tim1_cnt                       :32;  //0xb[31:0],TIM1的计数器回读值,0x0,RO
        }; 
        uint32_t v; 
    }tim1_cnt; 

    /* REG_0x0c */
    union 
    { 
        struct 
        { 
           volatile uint32_t  tim2_cnt                       :32;  //0xc[31:0],TIM2的计数器回读值,0x0,RO
        }; 
        uint32_t v; 
    }tim2_cnt; 

    /* REG_0x0d */
    union 
    { 
        struct 
        { 
           volatile uint32_t  tim3_cnt                       :32;  //0xd[31:0],TIM3的计数器回读值,0x0,RO
        }; 
        uint32_t v; 
    }tim3_cnt; 

    /* REG_0x0e */
    union 
    { 
        struct 
        { 
           volatile uint32_t  psc1                           : 8;  //0xe[7:0],TIM1的时钟预分频值 从1到256,0x0,R/W
           volatile uint32_t  psc2                           : 8;  //0xe[15:8],TIM2的时钟预分频值 从1到256,0x0,R/W
           volatile uint32_t  psc3                           : 8;  //0xe[23:16],TIM3的时钟预分频值 从1到256,0x0,R/W
           volatile uint32_t  reserved                       : 8;  //0xe[31:24], ,0x0,R/W
        }; 
        uint32_t v; 
    }prescaler; 

    /* REG_0x0f */
    union 
    { 
        struct 
        { 
           volatile uint32_t  tim1_arr                       :32;  //0xf[31:0],TIM1的定时器计数终点值preload寄存器,0x0,R/W
        }; 
        uint32_t v; 
    }tim1_arr; 

    /* REG_0x10 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  tim2_arr                       :32;  //0x10[31:0],TIM2的定时器计数终点值preload寄存器,0x0,R/W
        }; 
        uint32_t v; 
    }tim2_arr; 

    /* REG_0x11 */
    union 
    { 
        struct 
        { 
           volatile uint32_t  tim3_arr                       :32;  //0x11[31:0],TIM3的定时器计数终点值preload寄存器,0x0,R/W
        }; 
        uint32_t v; 
    }tim3_arr; 

